{"hide":0,"navigation":1,"toc":2,"welcome":3,"vllm":4,"figure":5,"markdown":6,"span":7,"assets":8,"logos":9,"logo":10,"text":11,"light":12,"png":13,"align":14,"center":15,"alt":16,"class":17,"width":18,"60":19,"dark":20,"style":21,"strong":22,"easy":23,"fast":24,"cheap":25,"llm":26,"serving":27,"everyone":28,"script":29,"async":30,"defer":31,"src":32,"https":33,"buttons":34,"github":35,"io":36,"js":37,"button":38,"href":39,"com":40,"project":41,"data":42,"show":43,"count":44,"true":45,"size":46,"large":47,"aria":48,"label":49,"star":50,"subscription":51,"icon":52,"octicon":53,"eye":54,"watch":55,"fork":56,"repo":57,"forked":58,"use":59,"library":60,"inference":61,"originally":62,"developed":63,"sky":64,"computing":65,"lab":66,"cs":67,"berkeley":68,"edu":69,"uc":70,"has":71,"evolved":72,"community":73,"driven":74,"contributions":75,"from":76,"both":77,"academia":78,"industry":79,"where":80,"get":81,"started":82,"depends":83,"type":84,"user":85,"you":86,"looking":87,"run":88,"open":89,"source":90,"models":91,"we":92,"recommend":93,"starting":94,"quickstart":95,"guide":96,"getting_started":97,"md":98,"build":99,"applications":100,"usage":101,"developer":102,"contributing":103,"information":104,"about":105,"development":106,"see":107,"roadmap":108,"ai":109,"releases":110,"state":111,"art":112,"throughput":113,"efficient":114,"management":115,"attention":116,"key":117,"value":118,"memory":119,"pagedattention":120,"blog":121,"2023":122,"06":123,"20":124,"html":125,"continuous":126,"batching":127,"incoming":128,"requests":129,"model":130,"execution":131,"cuda":132,"hip":133,"graph":134,"quantization":135,"gptq":136,"arxiv":137,"org":138,"abs":139,"2210":140,"17323":141,"awq":142,"2306":143,"00978":144,"int4":145,"int8":146,"fp8":147,"optimized":148,"kernels":149,"including":150,"integration":151,"flashattention":152,"flashinfer":153,"speculative":154,"decoding":155,"chunked":156,"prefill":157,"flexible":158,"seamless":159,"popular":160,"huggingface":161,"high":162,"various":163,"algorithms":164,"parallel":165,"sampling":166,"beam":167,"search":168,"more":169,"tensor":170,"pipeline":171,"expert":172,"parallelism":173,"support":174,"distributed":175,"streaming":176,"outputs":177,"openai":178,"compatible":179,"api":180,"server":181,"nvidia":182,"gpus":183,"amd":184,"cpus":185,"intel":186,"gaudi":187,"accelerators":188,"ibm":189,"power":190,"tpu":191,"aws":192,"trainium":193,"inferentia":194,"prefix":195,"caching":196,"multi":197,"lora":198,"check":199,"out":200,"following":201,"announcing":202,"post":203,"intro":204,"paper":205,"2309":206,"06180":207,"sosp":208,"how":209,"enables":210,"23x":211,"while":212,"reducing":213,"p50":214,"latency":215,"www":216,"anyscale":217,"cade":218,"daniel":219,"et":220,"al":221,"meetups":222,"summary":223,"configuration":224,"documentation":225,"classes":226,"config":227,"modelconfig":228,"cacheconfig":229,"loadconfig":230,"parallelconfig":231,"schedulerconfig":232,"deviceconfig":233,"speculativeconfig":234,"loraconfig":235,"multimodalconfig":236,"poolerconfig":237,"decodingconfig":238,"observabilityconfig":239,"kvtransferconfig":240,"compilationconfig":241,"vllmconfig":242,"offline":243,"inputs":244,"prompttype":245,"textprompt":246,"tokensprompt":247,"engines":248,"engine":249,"online":250,"llmengine":251,"asyncllmengine":252,"parameters":253,"apis":254,"params":255,"pooling":256,"samplingparams":257,"poolingparams":258,"modality":259,"provides":260,"experimental":261,"modal":262,"through":263,"multimodal":264,"package":265,"can":266,"passed":267,"alongside":268,"token":269,"prompts":270,"supported":271,"mm":272,"via":273,"multi_modal_data":274,"field":275,"add":276,"your":277,"own":278,"please":279,"follow":280,"instructions":281,"listed":282,"here":283,"multimodal_registry":284,"facing":285,"multimodaldatadict":286,"internal":287,"structures":288,"placeholderrange":289,"nestedtensors":290,"multimodalfieldelem":291,"multimodalfieldconfig":292,"multimodalkwargsitem":293,"multimodalkwargs":294,"multimodalinputs":295,"parsing":296,"parse":297,"processing":298,"profiling":299,"registry":300,"model_executor":301,"interfaces_base":302,"interfaces":303,"adapters":304,"cli":305,"command":306,"line":307,"tool":308,"used":309,"manage":310,"start":311,"viewing":312,"help":313,"message":314,"bash":315,"available":316,"commands":317,"chat":318,"complete":319,"serve":320,"bench":321,"collect":322,"env":323,"batch":324,"starts":325,"meta":326,"llama":327,"7b":328,"hf":329,"specify":330,"port":331,"8100":332,"over":333,"unix":334,"domain":335,"socket":336,"uds":337,"tmp":338,"sock":339,"options":340,"list":341,"all":342,"groups":343,"listgroup":344,"view":345,"argument":346,"group":347,"single":348,"max":349,"num":350,"seqs":351,"keyword":352,"full":353,"pager":354,"less":355,"page":356,"reference":357,"arguments":358,"generate":359,"completions":360,"running":361,"directly":362,"connect":363,"localhost":364,"without":365,"url":366,"http":367,"host":368,"v1":369,"quick":370,"prompt":371,"hi":372,"based":373,"given":374,"future":375,"benchmark":376,"tests":377,"install":378,"extra":379,"dependencies":380,"using":381,"pip":382,"1b":383,"instruct":384,"input":385,"len":386,"32":387,"output":388,"enforce":389,"eager":390,"load":391,"format":392,"dummy":393,"random":394,"collecting":395,"environment":396,"write":397,"results":398,"file":399,"local":400,"offline_inference":401,"openai_batch":402,"openai_example_batch":403,"jsonl":404,"8b":405,"remote":406,"raw":407,"githubusercontent":408,"main":409,"examples":410,"detailed":411,"any":412,"subcommand":413,"docs":414,"argparse":415,"when":416,"passing":417,"json":418,"sets":419,"equivalent":420,"arg":421,"key1":422,"value1":423,"key2":424,"key3":425,"value2":426,"additionally":427,"elements":428,"individually":429,"key4":430,"value3":431,"value4":432,"value5":433,"json_tip":434,"inc":435,"bench_latency":436,"bench_serve":437,"bench_throughput":438,"contact":439,"us":440,"readme":441,"regular":442,"san":443,"francisco":444,"bay":445,"area":446,"every":447,"months":448,"share":449,"updates":450,"team":451,"have":452,"guest":453,"speakers":454,"experience":455,"insights":456,"find":457,"materials":458,"our":459,"previous":460,"below":461,"beijing":462,"meetup":463,"mp":464,"weixin":465,"qq":466,"dgkwg1wfpwgo2jcdtqqhxa":467,"august":468,"2nd":469,"2025":470,"slides":471,"drive":472,"google":473,"folders":474,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":475,"recording":476,"chaspark":477,"live":478,"1166916873711665152":479,"nyc":480,"lu":481,"ma":482,"c1rqyf1f":483,"may":484,"7th":485,"presentation":486,"1_q_aw_iomjwuimf1s1ym":487,"zhjxz8cuel0ijvaquoybea":488,"edit":489,"usp":490,"sharing":491,"asia":492,"day":493,"sginnovate":494,"event":495,"limited":496,"availability":497,"morning":498,"evening":499,"slots":500,"remaining":501,"inaugural":502,"april":503,"3rd":504,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":505,"ollama":506,"night":507,"march":508,"27th":509,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":510,"first":511,"china":512,"n77gibl2coratqhtveazfg":513,"16th":514,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":515,"east":516,"coast":517,"7mu4k4xx":518,"11th":519,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":520,"slide":521,"id":522,"g31441846c39_0_0":523,"ninth":524,"h7g3kuj9":525,"february":526,"1jzc_pzvxrvnsfvcw":527,"v4cfxb6pn7zz2cyp_flwo05aqg":528,"eighth":529,"zep56hui":530,"cloud":531,"january":532,"22nd":533,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":534,"seventh":535,"h0qvrajz":536,"snowflake":537,"november":538,"14th":539,"2024":540,"1e3cxqbv3jsfgp30swyvs3em_tw":541,"ghohj9pajgk6kr54":542,"sixth":543,"87q3nvnh":544,"september":545,"9th":546,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":547,"9wqyp7ny93xrs":548,"fifth":549,"lp0gyjqr":550,"july":551,"24th":552,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":553,"fourth":554,"agivllm":555,"cloudflare":556,"bentoml":557,"june":558,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":559,"third":560,"robloxandvllmmeetup2024":561,"splashthat":562,"roblox":563,"1a":564,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":565,"second":566,"ygxbpzhl":567,"research":568,"31st":569,"12mi2skabnuw5rbwxdyy":570,"hthth4imsnceoq10jdqbxga":571,"video":572,"update":573,"youtu":574,"y0c":575,"duvenzq":576,"torch":577,"compile":578,"m0dmtfli":579,"dg":580,"a16z":581,"october":582,"5th":583,"1ql":584,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":585,"always":586,"sponsors":587,"potentially":588,"other":589,"locations":590,"interested":591,"speaking":592,"sponsoring":593,"questions":594,"lists":595,"mailto":596,"compute":597,"resources":598,"testing":599,"organizations":600,"thank":601,"note":602,"sort":603,"them":604,"alphabetical":605,"order":606,"keep":607,"consistent":608,"cash":609,"donations":610,"dropbox":611,"sequoia":612,"capital":613,"skywork":614,"zhenfund":615,"alibaba":616,"crusoe":617,"databricks":618,"deepinfra":619,"lambda":620,"nebius":621,"novita":622,"replicate":623,"runpod":624,"trainy":625,"diego":626,"slack":627,"sponsor":628,"also":629,"official":630,"fundraising":631,"venue":632,"opencollective":633,"plan":634,"fund":635,"maintenance":636,"adoption":637,"section":638,"most":639,"common":640,"three":641,"levels":642,"highest":643,"priority":644,"lowest":645,"request":646,"engine_args":647,"variables":648,"env_vars":649,"conserving":650,"might":651,"cause":652,"machine":653,"oom":654,"some":655,"alleviate":656,"problem":657,"tp":658,"tensor_parallel_size":659,"option":660,"split":661,"across":662,"multiple":663,"code":664,"splits":665,"python":666,"import":667,"granite":668,"warning":669,"ensure":670,"initializes":671,"correctly":672,"should":673,"avoid":674,"calling":675,"related":676,"functions":677,"set_device":678,"before":679,"initializing":680,"otherwise":681,"error":682,"like":683,"runtimeerror":684,"cannot":685,"re":686,"initialize":687,"subprocess":688,"control":689,"which":690,"devices":691,"instead":692,"set":693,"cuda_visible_devices":694,"variable":695,"enabled":696,"each":697,"process":698,"read":699,"whole":700,"chunks":701,"makes":702,"disk":703,"reading":704,"time":705,"even":706,"longer":707,"proportional":708,"convert":709,"checkpoint":710,"sharded":711,"gh":712,"save_sharded_state":713,"py":714,"conversion":715,"take":716,"later":717,"much":718,"faster":719,"loading":720,"remain":721,"constant":722,"regardless":723,"quantized":724,"cost":725,"lower":726,"precision":727,"statically":728,"downloaded":729,"hub":730,"ones":731,"red":732,"hat":733,"co":734,"redhatai":735,"dynamic":736,"features":737,"details":738,"context":739,"length":740,"further":741,"reduce":742,"limiting":743,"max_model_len":744,"maximum":745,"max_num_seqs":746,"adept":747,"fuyu":748,"2048":749,"graphs":750,"default":751,"optimize":752,"up":753,"gpu":754,"capture":755,"takes":756,"than":757,"v0":758,"adjust":759,"compilation_config":760,"achieve":761,"better":762,"balance":763,"between":764,"speed":765,"compilationlevel":766,"level":767,"piecewise":768,"goes":769,"cudagraph_capture_sizes":770,"16":771,"disable":772,"capturing":773,"completely":774,"enforce_eager":775,"flag":776,"cache":777,"cpu":778,"ram":779,"try":780,"only":781,"processor":782,"setting":783,"mm_processor_cache_gb":784,"gib":785,"per":786,"core":787,"backend":788,"kv":789,"vllm_cpu_kvcache_space":790,"limits":791,"allow":792,"smaller":793,"number":794,"items":795,"footprint":796,"accept":797,"images":798,"qwen":799,"qwen2":800,"vl":801,"3b":802,"limit_mm_per_prompt":803,"image":804,"go":805,"step":806,"unused":807,"modalities":808,"its":809,"limit":810,"zero":811,"example":812,"application":813,"accepts":814,"need":815,"allocate":816,"videos":817,"don":818,"just":819,"gemma":820,"27b":821,"certain":822,"processed":823,"turn":824,"saves":825,"series":826,"mm_processor_kwargs":827,"max_pixels":828,"768":829,"1280":830,"28":831,"internvl":832,"opengvlab":833,"internvl2":834,"2b":835,"max_dynamic_patch":836,"12":837,"toc_depth":838,"behavior":839,"part":840,"openai_compatible_server":841,"engineargs":842,"arg_utils":843,"asyncengineargs":844,"combination":845,"defined":846,"therefore":847,"truth":848,"types":849,"defaults":850,"docstrings":851,"async_engine_args":852,"uses":853,"configure":854,"system":855,"vllm_port":856,"vllm_host_ip":857,"ip":858,"work":859,"prefixed":860,"vllm_":861,"special":862,"care":863,"taken":864,"kubernetes":865,"users":866,"do":867,"name":868,"service":869,"conflict":870,"because":871,"capitalized":872,"concepts":873,"services":874,"networking":875,"envs":876,"vars":877,"definition":878,"resolution":879,"loads":880,"inspecting":881,"architectures":882,"repository":883,"finding":884,"corresponding":885,"implementation":886,"registered":887,"nevertheless":888,"fail":889,"reasons":890,"lacks":891,"unofficial":892,"repositories":893,"refer":894,"alternative":895,"names":896,"recorded":897,"same":898,"architecture":899,"creating":900,"ambiguity":901,"loaded":902,"fix":903,"explicitly":904,"overrides":905,"hf_overrides":906,"cerebras":907,"gpt":908,"gpt2lmheadmodel":909,"supported_models":910,"shows":911,"recognized":912,"optimization":913,"tuning":914,"covers":915,"strategies":916,"performance":917,"tip":918,"consult":919,"conserving_memory":920,"conserve":921,"preemption":922,"due":923,"auto":924,"regressive":925,"nature":926,"transformer":927,"times":928,"space":929,"insufficient":930,"handle":931,"batched":932,"cases":933,"preempt":934,"free":935,"preempted":936,"recomputed":937,"sufficient":938,"becomes":939,"again":940,"occurs":941,"05":942,"09":943,"00":944,"49":945,"33":946,"scheduler":947,"1057":948,"sequence":949,"preemptionmode":950,"recompute":951,"mode":952,"enough":953,"affect":954,"end":955,"increase":956,"gpu_memory_utilization":957,"provide":958,"total_cumulative_preemption_cnt":959,"mechanism":960,"ensures":961,"robustness":962,"recomputation":963,"adversely":964,"frequently":965,"encounter":966,"preemptions":967,"consider":968,"actions":969,"pre":970,"allocates":971,"percentage":972,"increasing":973,"utilization":974,"decrease":975,"max_num_batched_tokens":976,"reduces":977,"concurrent":978,"thereby":979,"requiring":980,"shards":981,"weights":982,"allowing":983,"however":984,"excessive":985,"synchronization":986,"overhead":987,"pipeline_parallel_size":988,"distributes":989,"layers":990,"needed":991,"indirectly":992,"leaving":993,"penalties":994,"monitor":995,"prometheus":996,"metrics":997,"exposed":998,"log":999,"cumulative":1000,"disable_log_stats":1001,"false":1002,"rather":1003,"swap":1004,"allows":1005,"prefills":1006,"together":1007,"decode":1008,"feature":1009,"helps":1010,"improve":1011,"balancing":1012,"bound":1013,"operations":1014,"different":1015,"conditionally":1016,"characteristics":1017,"scheduling":1018,"policy":1019,"prioritizes":1020,"batches":1021,"pending":1022,"tokens":1023,"budget":1024,"schedules":1025,"fit":1026,"automatically":1027,"two":1028,"benefits":1029,"improves":1030,"itl":1031,"generation":1032,"prioritized":1033,"locating":1034,"tune":1035,"adjusting":1036,"values":1037,"inter":1038,"fewer":1039,"slowing":1040,"down":1041,"decodes":1042,"higher":1043,"ttft":1044,"optimal":1045,"8096":1046,"especially":1047,"almost":1048,"except":1049,"still":1050,"16384":1051,"papers":1052,"pdf":1053,"2401":1054,"08671":1055,"2308":1056,"16369":1057,"supports":1058,"combined":1059,"hardware":1060,"configurations":1061,"within":1062,"layer":1063,"strategy":1064,"node":1065,"too":1066,"pressure":1067,"70b":1068,"parameter":1069,"essential":1070,"pp":1071,"processes":1072,"parts":1073,"ve":1074,"already":1075,"maxed":1076,"distribute":1077,"nodes":1078,"very":1079,"deep":1080,"narrow":1081,"distribution":1082,"sharding":1083,"combine":1084,"ep":1085,"specialized":1086,"form":1087,"mixture":1088,"experts":1089,"moe":1090,"networks":1091,"specifically":1092,"deepseekv3":1093,"qwen3moe":1094,"want":1095,"computation":1096,"enable_expert_parallel":1097,"degree":1098,"what":1099,"dp":1100,"replicates":1101,"entire":1102,"scale":1103,"environments":1104,"isolation":1105,"beneficial":1106,"data_parallel_size":1107,"according":1108,"product":1109,"data_parallel_deployment":1110,"useful":1111,"inside":1112,"bottleneck":1113,"compared":1114,"excess":1115,"capacity":1116,"console":1117,"disabled":1118,"requires":1119,"one":1120,"correspondance":1121,"repeatedly":1122,"hugging":1123,"face":1124,"autoprocessor":1125,"commonly":1126,"conversations":1127,"benefit":1128,"larger":1129,"launch":1130,"look":1131,"yaml":1132,"must":1133,"long":1134,"those":1135,"outlined":1136,"above":1137,"serve_args":1138,"127":1139,"6379":1140,"uvicorn":1141,"info":1142,"case":1143,"supplied":1144,"simultaneously":1145,"precedence":1146,"priorities":1147,"some_model":1148,"tips":1149,"doc":1150,"serves":1151,"collection":1152,"handy":1153,"optimizing":1154,"workload":1155,"setup":1156,"installation":1157,"google_tpu":1158,"sizing":1159,"selecting":1160,"ideal":1161,"chips":1162,"instance":1163,"important":1164,"account":1165,"average":1166,"adequate":1167,"hbm":1168,"colab":1169,"calculator":1170,"ericehanley":1171,"rightsize":1172,"blob":1173,"hbm_calculator":1174,"ipynb":1175,"tell":1176,"requirement":1177,"consumed":1178,"allocated":1179,"approximately":1180,"approach":1181,"general":1182,"rule":1183,"thumb":1184,"tradeoff":1185,"rightsizing":1186,"fine":1187,"decreasing":1188,"defines":1189,"effectively":1190,"maximize":1191,"overall":1192,"often":1193,"increases":1194,"e2e":1195,"carefully":1196,"crucial":1197,"achieving":1198,"desired":1199,"specific":1200,"similar":1201,"way":1202,"adjusted":1203,"compilation":1204,"coming":1205,"background":1206,"differences":1207,"ll":1208,"notice":1209,"tpus":1210,"initial":1211,"asics":1212,"executing":1213,"compiled":1214,"static":1215,"xla":1216,"compiler":1217,"unlike":1218,"shapes":1219,"flexibly":1220,"require":1221,"shape":1222,"performs":1223,"warmup":1224,"during":1225,"phase":1226,"compiles":1227,"storage":1228,"located":1229,"xla_cache":1230,"range":1231,"significantly":1232,"anywhere":1233,"few":1234,"minutes":1235,"hour":1236,"depending":1237,"although":1238,"subsequent":1239,"launches":1240,"eliminating":1241,"runs":1242,"vllm_xla_cache_path":1243,"shareable":1244,"deployed":1245,"autoscaling":1246,"ranges":1247,"impacted":1248,"many":1249,"discussed":1250,"factors":1251,"influence":1252,"things":1253,"vllm_tpu_most_model_len":1254,"vs":1255,"most_model_len":1256,"design":1257,"shorter":1258,"accommodate":1259,"occasional":1260,"negatively":1261,"impact":1262,"introducing":1263,"specifying":1264,"32k":1265,"99":1266,"2k":1267,"pass":1268,"32768":1269,"subdivided":1270,"categories":1271,"latter":1272,"category":1273,"gain":1274,"since":1275,"padding":1276,"requirements":1277,"switching":1278,"bucket":1279,"vllm_tpu_bucket_padding_gap":1280,"layout":1281,"increments":1282,"128":1283,"256":1284,"etc":1285,"pads":1286,"fixed":1287,"lengths":1288,"sending":1289,"recompilation":1290,"efficiencies":1291,"currently":1292,"ways":1293,"pad":1294,"exponential":1295,"nearest":1296,"linearly":1297,"buckets":1298,"increment":1299,"512":1300,"padding_gap":1301,"64":1302,"192":1303,"320":1304,"384":1305,"448":1306,"unnecessary":1307,"does":1308,"num_tokens":1309,"300":1310,"bucket_padding":1311,"careful":1312,"choose":1313,"gap":1314,"small":1315,"means":1316,"leading":1317,"increased":1318,"precompile":1319,"store":1320,"compilaed":1321,"lead":1322,"conversely":1323,"overly":1324,"yields":1325,"improvement":1326,"possible":1327,"matches":1328,"chip":1329,"acceleration":1330,"v5e":1331,"mxu":1332,"v6e":1333,"formats":1334,"jul":1335,"25":1336,"w8a8":1337,"w8a16":1338,"wip":1339,"fp4":1340,"w4a8":1341,"parallelization":1342,"deployment":1343,"fragment":1344,"workloads":1345,"create":1346,"partial":1347,"great":1348,"configs":1349,"strongly":1350,"tuner":1351,"benchmarks":1352,"auto_tune":1353,"topics":1354,"cover":1355,"profile":1356,"final":1357,"interpreting":1358,"challenging":1359,"new":1360,"expand":1361,"guidance":1362,"meantime":1363,"learn":1364,"native":1365,"tools":1366,"profiling_tpu":1367,"valuable":1368,"spmd":1369,"come":1370,"something":1371,"isn":1372,"issue":1373,"cite":1374,"love":1375,"hear":1376,"interest":1377,"welcomes":1378,"kinds":1379,"matter":1380,"several":1381,"contribute":1382,"identify":1383,"report":1384,"issues":1385,"bugs":1386,"suggest":1387,"implement":1388,"believe":1389,"thus":1390,"answering":1391,"queries":1392,"offering":1393,"pr":1394,"reviews":1395,"assisting":1396,"others":1397,"highly":1398,"regarded":1399,"finally":1400,"impactful":1401,"raising":1402,"awareness":1403,"talk":1404,"posts":1405,"highlight":1406,"driving":1407,"incredible":1408,"projects":1409,"express":1410,"social":1411,"media":1412,"simply":1413,"offer":1414,"appreciation":1415,"starring":1416,"job":1417,"board":1418,"unsure":1419,"links":1420,"tasks":1421,"good":1422,"3aissue":1423,"20state":1424,"3aopen":1425,"20label":1426,"3a":1427,"22good":1428,"20first":1429,"20issue":1430,"22":1431,"selected":1432,"onboarding":1433,"22new":1434,"capabilities":1435,"10":1436,"license":1437,"developing":1438,"python_env_setup":1439,"kind":1440,"building":1441,"workflow":1442,"iterating":1443,"incremental":1444,"incremental_build":1445,"recommendations":1446,"mkdocs":1447,"introduction":1448,"simple":1449,"downright":1450,"gorgeous":1451,"site":1452,"generator":1453,"geared":1454,"towards":1455,"files":1456,"written":1457,"configured":1458,"plugins":1459,"along":1460,"well":1461,"required":1462,"uv":1463,"txt":1464,"version":1465,"awesome":1466,"nav":1467,"verify":1468,"confirm":1469,"installed":1470,"opt":1471,"miniconda3":1472,"mkdoc":1473,"lib":1474,"python3":1475,"packages":1476,"clone":1477,"git":1478,"cd":1479,"comes":1480,"built":1481,"dev":1482,"lets":1483,"preview":1484,"make":1485,"sure":1486,"directory":1487,"yml":1488,"106":1489,"83":1490,"seconds":1491,"02":1492,"watching":1493,"paths":1494,"changes":1495,"8000":1496,"browser":1497,"additional":1498,"advanced":1499,"platforms":1500,"linting":1501,"formatting":1502,"checking":1503,"commit":1504,"manually":1505,"diff":1506,"failure":1507,"ci":1508,"locally":1509,"mypy":1510,"hook":1511,"stage":1512,"manual":1513,"unit":1514,"pytest":1515,"test":1516,"test_logger":1517,"docker":1518,"dockerfile":1519,"ships":1520,"minimise":1521,"chance":1522,"clashing":1523,"missing":1524,"fails":1525,"sudo":1526,"apt":1527,"fully":1528,"checked":1529,"access":1530,"platform":1531,"rely":1532,"now":1533,"bug":1534,"existing":1535,"been":1536,"reported":1537,"providing":1538,"relevant":1539,"discover":1540,"security":1541,"vulnerability":1542,"reporting":1543,"pull":1544,"contribution":1545,"submitting":1546,"meets":1547,"criteria":1548,"maintain":1549,"quality":1550,"efficiency":1551,"review":1552,"dco":1553,"signed":1554,"off":1555,"agree":1556,"commits":1557,"include":1558,"header":1559,"certifies":1560,"agreement":1561,"terms":1562,"enable":1563,"automatic":1564,"sign":1565,"ide":1566,"pycharm":1567,"click":1568,"right":1569,"push":1570,"window":1571,"bring":1572,"modify":1573,"author":1574,"vscode":1575,"settings":1576,"editor":1577,"visualstudio":1578,"alwayssignoff":1579,"title":1580,"classification":1581,"prs":1582,"reviewed":1583,"appropriately":1584,"indicate":1585,"change":1586,"bugfix":1587,"fixes":1588,"improvements":1589,"adding":1590,"improving":1591,"appear":1592,"frontend":1593,"kernel":1594,"affecting":1595,"logic":1596,"vendor":1597,"misc":1598,"sparingly":1599,"spans":1600,"prefixes":1601,"needs":1602,"meet":1603,"standards":1604,"adhere":1605,"styleguide":1606,"pyguide":1607,"cppguide":1608,"linter":1609,"checks":1610,"documented":1611,"contributors":1612,"easily":1613,"understand":1614,"stays":1615,"correct":1616,"robust":1617,"includes":1618,"modifies":1619,"behaviors":1620,"utilize":1621,"changing":1622,"actively":1623,"modifying":1624,"recommended":1625,"custom":1626,"schema":1627,"implementations":1628,"pytorch":1629,"ops":1630,"guidelines":1631,"operators":1632,"tutorials":1633,"cpp_custom_ops":1634,"cpp":1635,"tutorial":1636,"document":1637,"1_w62p8wjoqquzpsjya7s701jxt0qf2oflub2sbkhoau":1638,"return":1639,"tensors":1640,"implemented":1641,"so":1642,"dims":1643,"handled":1644,"documents":1645,"description":1646,"opcheck":1647,"stable":1648,"function":1649,"registration":1650,"signature":1651,"op":1652,"updated":1653,"reflect":1654,"pt2":1655,"18fbmpuoj0fy5zq6yyrhuppw9fa332cpntgb6soigyua":1656,"notes":1657,"concise":1658,"major":1659,"architectural":1660,"500":1661,"loc":1662,"excluding":1663,"would":1664,"expect":1665,"rfc":1666,"discussing":1667,"technical":1668,"justification":1669,"tag":1670,"goal":1671,"transparent":1672,"reviewing":1673,"contributor":1674,"feels":1675,"confused":1676,"frustrated":1677,"prioritize":1678,"after":1679,"submitted":1680,"assigned":1681,"reviewer":1682,"pick":1683,"expertise":1684,"status":1685,"days":1686,"feel":1687,"ping":1688,"put":1689,"action":1690,"address":1691,"comments":1692,"respond":1693,"reasonable":1694,"frame":1695,"comment":1696,"clear":1697,"disagree":1698,"suggestion":1699,"ask":1700,"clarification":1701,"discuss":1702,"executed":1703,"computational":1704,"ready":1705,"merge":1706,"taking":1707,"suites":1708,"contains":1709,"nightly":1710,"whether":1711,"under":1712,"triggered":1713,"perf":1714,"labels":1715,"merged":1716,"latest":1717,"hosted":1718,"public":1719,"dashboard":1720,"hud":1721,"llms":1722,"reponame":1723,"2fvllm":1724,"found":1725,"buildkite":1726,"descriptions":1727,"compare":1728,"against":1729,"alternatives":1730,"tgi":1731,"trt":1732,"lmdeploy":1733,"bumping":1734,"primarily":1735,"intended":1736,"consumers":1737,"evaluate":1738,"shared":1739,"release":1740,"deprecation":1741,"outlines":1742,"deprecating":1743,"overview":1744,"structured":1745,"lifecycle":1746,"deprecated":1747,"deprecations":1748,"proceed":1749,"predictable":1750,"manner":1751,"aim":1752,"strike":1753,"continued":1754,"innovation":1755,"respecting":1756,"reliance":1757,"functionality":1758,"tied":1759,"minor":1760,"semantic":1761,"versioning":1762,"rare":1763,"significant":1764,"removals":1765,"patch":1766,"safer":1767,"enhancements":1768,"fall":1769,"minimum":1770,"flags":1771,"consists":1772,"clearly":1773,"stages":1774,"marked":1775,"timeline":1776,"removal":1777,"stated":1778,"removed":1779,"communication":1780,"noted":1781,"applicable":1782,"strings":1783,"responses":1784,"feedback":1785,"typing_extensions":1786,"decorator":1787,"throws":1788,"enabling":1789,"purpose":1790,"who":1791,"missed":1792,"earlier":1793,"warnings":1794,"temporary":1795,"escape":1796,"hatch":1797,"signaling":1798,"imminent":1799,"surfaced":1800,"blocks":1801,"silent":1802,"breakage":1803,"codebase":1804,"assume":1805,"legacy":1806,"11":1807,"removing":1808,"disallowed":1809,"surprising":1810,"grace":1811,"period":1812,"retroactively":1813,"critical":1814,"living":1815,"evolve":1816,"encouraged":1817,"refine":1818,"working":1819,"csrc":1820,"recompiling":1821,"consuming":1822,"cmake":1823,"iteration":1824,"necessary":1825,"components":1826,"complements":1827,"editable":1828,"prerequisites":1829,"wheels":1830,"recompilations":1831,"venv":1832,"seed":1833,"bin":1834,"activate":1835,"vllm_use_precompiled":1836,"toolkit":1837,"nvcc":1838,"accessible":1839,"path":1840,"relies":1841,"typically":1842,"cuda_home":1843,"guides":1844,"archive":1845,"troubleshooting":1846,"cmake_cuda_compiler":1847,"cmakeuserpresets":1848,"point":1849,"binary":1850,"ccache":1851,"rebuilds":1852,"conda":1853,"ninja":1854,"installable":1855,"manager":1856,"managed":1857,"root":1858,"helper":1859,"simplify":1860,"attempts":1861,"detect":1862,"cores":1863,"generates":1864,"navigate":1865,"execute":1866,"generate_cmake_presets":1867,"determine":1868,"executable":1869,"screen":1870,"confirmation":1871,"overwriting":1872,"created":1873,"generated":1874,"tailor":1875,"cmakeminimumrequired":1876,"26":1877,"configurepresets":1878,"binarydir":1879,"sourcedir":1880,"cachevariables":1881,"usr":1882,"cmake_c_compiler_launcher":1883,"cmake_cxx_compiler_launcher":1884,"cmake_cuda_compiler_launcher":1885,"cmake_build_type":1886,"vllm_python_executable":1887,"home":1888,"venvs":1889,"cmake_install_prefix":1890,"cmake_cuda_flags":1891,"nvcc_threads":1892,"cmake_job_pools":1893,"buildpresets":1894,"configurepreset":1895,"jobs":1896,"mean":1897,"sccache":1898,"speeds":1899,"defaulting":1900,"current":1901,"suitable":1902,"specifies":1903,"back":1904,"newly":1905,"immediately":1906,"presets":1907,"detected":1908,"artifacts":1909,"stored":1910,"installing":1911,"once":1912,"configures":1913,"chosen":1914,"preset":1915,"creates":1916,"installs":1917,"resulting":1918,"binaries":1919,"making":1920,"target":1921,"repeat":1922,"affected":1923,"verifying":1924,"successful":1925,"populated":1926,"ls":1927,"cmake_install":1928,"_deps":1929,"machete_generation":1930,"cpackconfig":1931,"detect_cuda_compute_capabilities":1932,"cu":1933,"marlin_generation":1934,"_c":1935,"abi3":1936,"cpacksourceconfig":1937,"detect_cuda_version":1938,"cc":1939,"_moe_c":1940,"cmakecache":1941,"ctest":1942,"_flashmla_c":1943,"moe_marlin_generation":1944,"cmakefiles":1945,"cumem_allocator":1946,"install_local_manifest":1947,"flash":1948,"attn":1949,"copies":1950,"libraries":1951,"appropriate":1952,"tree":1953,"overload":1954,"systems":1955,"slower":1956,"builds":1957,"instability":1958,"won":1959,"clean":1960,"persistent":1961,"strange":1962,"errors":1963,"branches":1964,"rm":1965,"rf":1966,"iterations":1967,"module":1968,"sometimes":1969,"though":1970,"developers":1971,"maintainers":1972,"proportion":1973,"spent":1974,"never":1975,"slow":1976,"profiler":1977,"tracing":1978,"workers":1979,"vllm_torch_profiler_dir":1980,"save":1981,"traces":1982,"mnt":1983,"content":1984,"vllm_torch_profiler_record_shapes":1985,"vllm_torch_profiler_with_profile_memory":1986,"record":1987,"vllm_torch_profiler_with_stack":1988,"stack":1989,"vllm_torch_profiler_with_flops":1990,"flops":1991,"visualized":1992,"ui":1993,"perfetto":1994,"call":1995,"entrypoints":1996,"send":1997,"quite":1998,"untar":1999,"viewed":2000,"stop":2001,"flushes":2002,"trace":2003,"100":2004,"worth":2005,"flush":2006,"h100":2007,"vllm_rpc_timeout":2008,"big":2009,"say":2010,"30":2011,"export":2012,"1800000":2013,"simple_profiling":2014,"vllm_profile":2015,"api_server":2016,"dataset":2017,"sharegpt":2018,"nsight":2019,"exposes":2020,"register":2021,"annotated":2022,"regions":2023,"low":2024,"events":2025,"installationguide":2026,"index":2027,"block":2028,"ubuntu":2029,"recommends":2030,"gnupg":2031,"echo":2032,"deb":2033,"download":2034,"devtools":2035,"repos":2036,"lsb":2037,"distrib_release":2038,"tr":2039,"dpkg":2040,"print":2041,"tee":2042,"sources":2043,"adv":2044,"fetch":2045,"keys":2046,"ubuntu1804":2047,"x86_64":2048,"7fa2af80":2049,"pub":2050,"basic":2051,"append":2052,"nsys":2053,"rep":2054,"exec":2055,"iters":2056,"prepend":2057,"delay":2058,"xx":2059,"duration":2060,"yy":2061,"killed":2062,"client":2063,"1024":2064,"practice":2065,"whenever":2066,"sessions":2067,"session":2068,"xxxxx":2069,"kill":2070,"analysis":2071,"profiles":2072,"either":2073,"summaries":2074,"stats":2075,"gui":2076,"directions":2077,"report1":2078,"cuda_gpu_kern_sum":2079,"total":2080,"ns":2081,"instances":2082,"avg":2083,"med":2084,"min":2085,"stddev":2086,"46":2087,"327":2088,"352":2089,"338":2090,"17":2091,"505":2092,"589":2093,"965":2094,"144":2095,"383":2096,"27":2097,"040":2098,"126":2099,"460":2100,"944":2101,"263":2102,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize128x128x64_warpgroupsize1x1x1_execute_segment_k_of":2103,"14":2104,"305":2105,"114":2106,"764":2107,"152":2108,"641":2109,"520":2110,"293":2111,"408":2112,"287":2113,"296":2114,"822":2115,"716":2116,"867":2117,"124":2118,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize256x128x64_warpgroupsize2x1x1_execute_segment_k_of":2119,"692":2120,"284":2121,"876":2122,"280":2123,"188":2124,"535":2125,"904":2126,"19":2127,"328":2128,"862":2129,"237":2130,"497":2131,"999":2132,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize64x128x64_warpgroupsize1x1x1_execute_segment_k_off":2133,"116":2134,"600":2135,"578":2136,"920":2137,"62":2138,"399":2139,"21":2140,"504":2141,"15":2142,"326":2143,"532":2144,"285":2145,"290":2146,"954":2147,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize64x64x64_warpgroupsize1x1x1_execute_segment_k_off_":2148,"119":2149,"749":2150,"165":2151,"18":2152,"912":2153,"59":2154,"208":2155,"056":2156,"784":2157,"366":2158,"271":2159,"581":2160,"void":2161,"act_and_mul_kernel":2162,"c10":2163,"bfloat16":2164,"silu_kernel":2165,"bool":2166,"t1":2167,"cons":2168,"916":2169,"662":2170,"515":2171,"312":2172,"43":2173,"011":2174,"776":2175,"928":2176,"586":2177,"205":2178,"199":2179,"790":2180,"cutlass":2181,"device_kernel":2182,"enable_sm90_or_later":2183,"flashattnfwdsm90":2184,"collectivema":2185,"587":2186,"283":2187,"113":2188,"37":2189,"824":2190,"526":2191,"008":2192,"719":2193,"517":2194,"756":2195,"139":2196,"091":2197,"std":2198,"enable_if":2199,"t2":2200,"int":2201,"_typeconvert":2202,"exists":2203,"fused_add_rms_norm_kern":2204,"418":2205,"362":2206,"605":2207,"121":2208,"871":2209,"523":2210,"870":2211,"175":2212,"248":2213,"rotary_embedding_kernel":2214,"const":2215,"167":2216,"083":2217,"069":2218,"880":2219,"849":2220,"240":2221,"471":2222,"499":2223,"996":2224,"101":2225,"436":2226,"reshape_and_cache_flash_kernel":2227,"__nv_bfloat16":2228,"fp8kvcachedatatype":2229,"img":2230,"1799":2231,"screenshot":2232,"03":2233,"48":2234,"42":2235,"am":2236,"attachments":2237,"c7cff1ae":2238,"6d6f":2239,"477d":2240,"a342":2241,"bd13c4fc424c":2242,"standard":2243,"cprofile":2244,"couple":2245,"helpers":2246,"apply":2247,"utils":2248,"cprofile_context":2249,"filename":2250,"specified":2251,"saved":2252,"printed":2253,"stdout":2254,"expensive_function":2255,"prof":2256,"def":2257,"expensive":2258,"optional":2259,"another_function":2260,"analyzing":2261,"analyze":2262,"snakeviz":2263,"jiffyclub":2264,"vulnerabilities":2265,"mentioned":2266,"privately":2267,"advisories":2268,"vmt":2269,"responsible":2270,"managing":2271,"triaging":2272,"coordinating":2273,"reporters":2274,"drafting":2275,"confirmed":2276,"coordination":2277,"coordinated":2278,"advisory":2279,"published":2280,"en":2281,"members":2282,"prefer":2283,"urgent":2284,"individuals":2285,"simon":2286,"mo":2287,"hey":2288,"russell":2289,"bryant":2290,"rbryant":2291,"redhat":2292,"huzaifa":2293,"sidhpurwala":2294,"huzaifas":2295,"discussion":2296,"channel":2297,"disclose":2298,"member":2299,"disclosure":2300,"disclosing":2301,"develop":2302,"coordinate":2303,"reporter":2304,"prepare":2305,"adequately":2306,"describes":2307,"publish":2308,"minimize":2309,"amount":2310,"failures":2311,"my":2312,"think":2313,"caused":2314,"orgs":2315,"likely":2316,"unrelated":2317,"fixing":2318,"leave":2319,"react":2320,"signal":2321,"filing":2322,"template":2323,"450":2324,"failing":2325,"regex":2326,"matching":2327,"abcdef123":2328,"failed":2329,"failing_test1":2330,"failing_test2":2331,"400":2332,"failing_test3":2333,"attach":2334,"logs":2335,"collapsible":2336,"38":2337,"dump_input":2338,"68":2339,"dumping":2340,"logging":2341,"traceback":2342,"recent":2343,"last":2344,"dist":2345,"203":2346,"execute_model":2347,"self":2348,"scheduler_output":2349,"wrangling":2350,"strip":2351,"timestamps":2352,"colorization":2353,"scripts":2354,"sh":2355,"wl":2356,"clipboard":2357,"bugaevc":2358,"copy":2359,"pasting":2360,"tail":2361,"525":2362,"ci_build":2363,"investigating":2364,"branch":2365,"bisect":2366,"findings":2367,"candidate":2368,"mention":2369,"reproducing":2370,"flaky":2371,"loop":2372,"rerun":2373,"test_engine_core_client":2374,"test_kv_cache_events":2375,"tcp":2376,"submit":2377,"link":2378,"closes":2379,"12345":2380,"track":2381,"reliability":2382,"analytics":2383,"asc":2384,"sort_by":2385,"daily":2386,"triage":2387,"2days":2388,"exclude":2389,"legitimate":2390,"ignore":2391,"oss":2392,"early":2393,"cadence":2394,"non":2395,"trivial":2396,"16859":2397,"steps":2398,"potential":2399,"candidates":2400,"rcs":2401,"updating":2402,"discovered":2403,"resolved":2404,"waiting":2405,"next":2406,"implementing":2407,"hacky":2408,"workarounds":2409,"solution":2410,"rc":2411,"compatibility":2412,"whl":2413,"torch2":2414,"cu12":2415,"torchvision":2416,"torchaudio":2417,"cu128":2418,"announced":2419,"forum":2420,"announcements":2421,"announcement":2422,"begin":2423,"rocm6":2424,"applied":2425,"uv_index_strategy":2426,"unsafe":2427,"best":2428,"match":2429,"raise":2430,"initiate":2431,"matrix":2432,"versions":2433,"limitations":2434,"cu126":2435,"uploaded":2436,"pypi":2437,"blackwell":2438,"complicates":2439,"box":2440,"dockerfiles":2441,"indexes":2442,"moment":2443,"rocm":2444,"xpu":2445,"wheel":2446,"tested":2447,"upload":2448,"exist":2449,"s3":2450,"causing":2451,"hours":2452,"timeout":2453,"fastcheck":2454,"doesn":2455,"populate":2456,"warm":2457,"ineffective":2458,"ongoing":2459,"efforts":2460,"17419":2461,"workaround":2462,"vllm_ci_branch":2463,"provided":2464,"khluu":2465,"use_postmerge_q":2466,"triggering":2467,"accomplishes":2468,"a8ff0fcd":2469,"76e0":2470,"4e91":2471,"b72f":2472,"014e3fdb6b94":2473,"depend":2474,"accordingly":2475,"unblock":2476,"27bebcd89792d5c4b08af7a65095759526f2f9e1":2477,"l259":2478,"l271":2479,"torch_cuda_arch_list":2480,"ptx":2481,"flashinfer_enable_sm90":2482,"post1":2483,"caveat":2484,"adds":2485,"preferable":2486,"location":2487,"immediate":2488,"flashinfer_python":2489,"2bcu128torch2":2490,"cp39":2491,"linux_x86_64":2492,"xformers":2493,"max_jobs":2494,"facebookresearch":2495,"attempting":2496,"manageable":2497,"separately":2498,"separation":2499,"selectively":2500,"extension":2501,"17444":2502,"completed":2503,"construct":2504,"deploying":2505,"visual":2506,"representation":2507,"highlighted":2508,"grey":2509,"external":2510,"dashed":2511,"borders":2512,"edges":2513,"represent":2514,"solid":2515,"arrow":2516,"head":2517,"empty":2518,"mount":2519,"dotted":2520,"diamond":2521,"dependency":2522,"query":2523,"made":2524,"patrickhoefler":2525,"dockerfilegraph":2526,"regenerate":2527,"present":2528,"legend":2529,"dpi":2530,"200":2531,"50":2532,"workdir":2533,"workspace":2534,"volume":2535,"pwd":2536,"ghcr":2537,"alpine":2538,"decoder":2539,"language":2540,"transformers":2541,"having":2542,"works":2543,"advantage":2544,"compatibility_matrix":2545,"complexity":2546,"integrating":2547,"heavily":2548,"considerably":2549,"straightforward":2550,"shares":2551,"complex":2552,"pages":2553,"registering":2554,"encountering":2555,"happy":2556,"walks":2557,"adapted":2558,"modeling_opt":2559,"original":2560,"copyright":2561,"licensing":2562,"initialization":2563,"modules":2564,"constructor":2565,"dictionary":2566,"runtime":2567,"operator":2568,"unique":2569,"conflicts":2570,"uniform":2571,"quantize":2572,"keeping":2573,"initialized":2574,"nn":2575,"myattention":2576,"__init__":2577,"vllm_config":2578,"str":2579,"super":2580,"mydecoderlayer":2581,"self_attn":2582,"mymodel":2583,"modulelist":2584,"model_config":2585,"hf_config":2586,"num_hidden_layers":2587,"mymodelforcausallm":2588,"get_input_embeddings":2589,"method":2590,"returns":2591,"embeddings":2592,"input_ids":2593,"embedding":2594,"unified":2595,"interface":2596,"composite":2597,"rewrite":2598,"forward":2599,"remove":2600,"training":2601,"treat":2602,"positions":2603,"flattened":2604,"dimension":2605,"intermediate_tensors":2606,"intermediatetensors":2607,"none":2608,"inputs_embeds":2609,"variant":2610,"rotary":2611,"positional":2612,"employs":2613,"yours":2614,"adapt":2615,"dir":2616,"substitute":2617,"linear":2618,"replace":2619,"vocabparallelembedding":2620,"lm":2621,"parallellmhead":2622,"parallelize":2623,"replicatedlinear":2624,"saving":2625,"rowparallellinear":2626,"partitioned":2627,"hidden":2628,"weight":2629,"rows":2630,"operation":2631,"performed":2632,"multiplication":2633,"ffn":2634,"transformation":2635,"columnparallellinear":2636,"replicated":2637,"columns":2638,"result":2639,"column":2640,"separated":2641,"qkv":2642,"mergedcolumnparallellinear":2643,"merges":2644,"weighted":2645,"activation":2646,"silu":2647,"handles":2648,"matrices":2649,"qkvparallellinear":2650,"projections":2651,"grouped":2652,"mechanisms":2653,"heads":2654,"world":2655,"properly":2656,"replication":2657,"linear_method":2658,"schemes":2659,"load_weights":2660,"forcausallm":2661,"assign":2662,"asked":2663,"interleaving":2664,"sliding":2665,"windows":2666,"mistralai":2667,"ministral":2668,"2410":2669,"dropped":2670,"appears":2671,"layer_types":2672,"modeling":2673,"per_layer_sliding_window":2674,"996357e4808ca5eab97d4c97c7d25b3073f46aab":2675,"l171":2676,"interleave":2677,"extend":2678,"multimodal_inputs":2679,"base":2680,"assumed":2681,"follows":2682,"get_placeholder_str":2683,"supportsmultimodal":2684,"define":2685,"placeholder":2686,"string":2687,"item":2688,"yourmodelforimage2seq":2689,"classmethod":2690,"cls":2691,"startswith":2692,"valueerror":2693,"reserve":2694,"corresponds":2695,"shown":2696,"pixel_values":2697,"sampleroutput":2698,"conveniently":2699,"kwargs":2700,"retrieve":2701,"get_multimodal_embeddings":2702,"tokenizer":2703,"boilerplate":2704,"typical":2705,"pattern":2706,"_process_image_input":2707,"image_input":2708,"yourmodelimageinputs":2709,"assert":2710,"vision_encoder":2711,"image_features":2712,"multi_modal_projector":2713,"object":2714,"multimodalembeddings":2715,"validate":2716,"_parse_and_validate_image_input":2717,"encoder":2718,"projector":2719,"vision_embeddings":2720,"returned":2721,"multimodal_embeddings":2722,"3d":2723,"num_items":2724,"feature_size":2725,"hidden_size":2726,"tuple":2727,"2d":2728,"retrieves":2729,"th":2730,"sections":2731,"leverage":2732,"utility":2733,"merge_multimodal_embeddings":2734,"language_model":2735,"placeholder_token_id":2736,"image_token_index":2737,"get_language_model":2738,"getter":2739,"underlying":2740,"done":2741,"named":2742,"model_doc":2743,"subclass":2744,"baseprocessinginfo":2745,"override":2746,"abstract":2747,"get_supported_mm_limits":2748,"mapping":2749,"inherit":2750,"basedummyinputsbuilder":2751,"methods":2752,"get_dummy_text":2753,"get_dummy_mm_data":2754,"worst":2755,"assuming":2756,"constructed":2757,"llava":2758,"llavaforconditionalgeneration":2759,"v4":2760,"47":2761,"modeling_llava":2762,"l530":2763,"l544":2764,"n_image_tokens":2765,"sum":2766,"n_image_features":2767,"special_image_mask":2768,"unsqueeze":2769,"expand_as":2770,"device":2771,"dtype":2772,"masked_scatter":2773,"calculated":2774,"get_image_features":2775,"l290":2776,"l300":2777,"image_outputs":2778,"vision_tower":2779,"output_hidden_states":2780,"selected_image_feature":2781,"hidden_states":2782,"vision_feature_layer":2783,"vision_feature_select_strategy":2784,"elif":2785,"else":2786,"unexpected":2787,"select":2788,"infer":2789,"vision":2790,"tower":2791,"clipvisionmodel":2792,"moreover":2793,"determined":2794,"states":2795,"clipvisiontransformer":2796,"clip":2797,"modeling_clip":2798,"l1094":2799,"l1102":2800,"interpolate_pos_encoding":2801,"pre_layrnorm":2802,"encoder_outputs":2803,"output_attentions":2804,"return_dict":2805,"clipvisionembeddings":2806,"l247":2807,"l257":2808,"target_dtype":2809,"patch_embedding":2810,"patch_embeds":2811,"grid":2812,"flatten":2813,"transpose":2814,"class_embeds":2815,"class_embedding":2816,"batch_size":2817,"cat":2818,"dim":2819,"height":2820,"position_embedding":2821,"position_ids":2822,"num_positions":2823,"l195":2824,"l196":2825,"num_patches":2826,"image_size":2827,"patch_size":2828,"get_num_image_tokens":2829,"image_width":2830,"image_height":2831,"get_hf_config":2832,"hf_processor":2833,"get_hf_processor":2834,"vision_config":2835,"num_image_tokens":2836,"calculate":2837,"actuality":2838,"usually":2839,"simplicity":2840,"get_image_size_with_most_features":2841,"imagesize":2842,"seq_len":2843,"mm_counts":2844,"num_images":2845,"target_width":2846,"target_height":2847,"_get_dummy_images":2848,"image_token":2849,"placeholders":2850,"fuyuforcausallm":2851,"modeling_fuyu":2852,"l311":2853,"l322":2854,"image_patches":2855,"past_key_values":2856,"patch_embeddings":2857,"vision_embed_tokens":2858,"squeeze":2859,"gather_continuous_embeddings":2860,"word_embeddings":2861,"continuous_embeddings":2862,"image_patch_input_indices":2863,"image_patches_indices":2864,"num_total_patches":2865,"patches":2866,"considering":2867,"fuyuprocessor":2868,"let":2869,"preprocessing":2870,"obtained":2871,"fuyuimageprocessor":2872,"preprocess":2873,"preprocess_with_tokenizer_info":2874,"resized":2875,"padded":2876,"returning":2877,"dimensions":2878,"resizing":2879,"metadata":2880,"processing_fuyu":2881,"l541":2882,"image_encoding":2883,"image_processor":2884,"output_kwargs":2885,"images_kwargs":2886,"batch_images":2887,"image_unpadded_heights":2888,"image_unpadded_widths":2889,"image_processing_fuyu":2890,"l480":2891,"do_resize":2892,"resize":2893,"input_data_format":2894,"image_sizes":2895,"get_image_size":2896,"channel_dim":2897,"do_pad":2898,"pad_image":2899,"padding_mode":2900,"constant_values":2901,"padding_value":2902,"l417":2903,"l425":2904,"model_image_input":2905,"tensor_batch_images":2906,"image_present":2907,"image_unpadded_h":2908,"image_unpadded_w":2909,"image_placeholder_id":2910,"image_newline_id":2911,"variable_sized":2912,"l638":2913,"l658":2914,"new_h":2915,"math":2916,"ceil":2917,"batch_index":2918,"subseq_index":2919,"patch_height":2920,"new_w":2921,"patch_width":2922,"get_num_patches":2923,"tensor_of_image_ids":2924,"int32":2925,"patchify_image":2926,"l552":2927,"l562":2928,"divisible":2929,"num_patches_per_dim_h":2930,"num_patches_per_dim_w":2931,"correspond":2932,"speaker":2933,"inputting":2934,"equal":2935,"get_image_processor":2936,"afterwards":2937,"basemultimodalprocessor":2938,"fill":2939,"mm_processing":2940,"fields":2941,"_get_mm_fields_config":2942,"outputted":2943,"clipimageprocessor":2944,"num_channels":2945,"image_processing_clip":2946,"l339":2947,"l345":2948,"to_channel_dimension_format":2949,"data_format":2950,"input_channel_dim":2951,"all_images":2952,"batchfeature":2953,"tensor_type":2954,"return_tensors":2955,"hf_inputs":2956,"hf_processor_mm_kwargs":2957,"dict":2958,"actual":2959,"computed":2960,"image_embeds":2961,"postprocessing":2962,"concatenates":2963,"belonging":2964,"l673":2965,"l679":2966,"image_input_ids":2967,"batch_image_input_ids":2968,"batch_image_patches":2969,"overriding":2970,"_call_hf_processor":2971,"mm_data":2972,"mm_kwargs":2973,"tok_kwargs":2974,"processed_outputs":2975,"isinstance":2976,"pn":2977,"px":2978,"handling":2979,"prevent":2980,"whereas":2981,"_get_prompt_updates":2982,"promptupdate":2983,"insertion":2984,"replacement":2985,"llavaprocessor":2986,"processing_llava":2987,"l167":2988,"l170":2989,"prompt_strings":2990,"sample":2991,"repeats":2992,"mm_items":2993,"multimodaldataitems":2994,"out_mm_kwargs":2995,"image_token_id":2996,"get_replacement":2997,"item_idx":2998,"get_items":2999,"imageprocessoritems":3000,"promptreplacement":3001,"recall":3002,"newline":3003,"ncols":3004,"nrows":3005,"get_image_feature_grid_size":3006,"height_scale_factor":3007,"width_scale_factor":3008,"optimal_scale_factor":3009,"initially":3010,"_image_token_id":3011,"_newline_token_id":3012,"entirely":3013,"called":3014,"bos":3015,"added":3016,"promopt":3017,"l435":3018,"prompt_tokens":3019,"prompts_length":3020,"_tokenize_prompts_with_image_and_batch":3021,"scale_factors":3022,"max_tokens_to_generate":3023,"max_position_embeddings":3024,"add_bos":3025,"add_beginning_of_answer_token":3026,"promptupdatedetails":3027,"bos_token_id":3028,"get_replacement_fuyu":3029,"image_tokens":3030,"select_token_id":3031,"embed_token_id":3032,"noticing":3033,"removes":3034,"endoftext":3035,"tokenized":3036,"conduct":3037,"get_tokenizer":3038,"eot_token_id":3039,"decorate":3040,"register_processor":3041,"multimodalregistry":3042,"yourmultimodalprocessor":3043,"yourprocessinginfo":3044,"dummy_inputs":3045,"yourdummyinputsbuilder":3046,"inserting":3047,"processors":3048,"insert":3049,"replacing":3050,"anything":3051,"promptinsertion":3052,"blip":3053,"blip2":3054,"florence2":3055,"molmo":3056,"assumes":3057,"_apply_hf_processor_tokens_only":3058,"applying":3059,"bypass":3060,"chameleon":3061,"appends":3062,"sep_token":3063,"boa_token":3064,"applies":3065,"elsewhere":3066,"deepseek":3067,"vl2":3068,"deepseek_vl2":3069,"qwen_vl":3070,"forking":3071,"gives":3072,"ability":3073,"_vllm_models":3074,"upon":3075,"importing":3076,"promote":3077,"maintained":3078,"plugin":3079,"plugin_system":3080,"entrypoint":3081,"modelregistry":3082,"your_code":3083,"yourmodelforcausallm":3084,"register_model":3085,"imports":3086,"lazy":3087,"implements":3088,"explains":3089,"min_transformers_version":3090,"skip":3091,"until":3092,"released":3093,"confidence":3094,"regressions":3095,"correctness":3096,"subdirectories":3097,"generative":3098,"generative_models":3099,"exact":3100,"check_outputs_equal":3101,"exactly":3102,"logprobs":3103,"similarity":3104,"check_logprobs_close":3105,"top":3106,"vice":3107,"versa":3108,"pooling_models":3109,"cosine":3110,"test_common":3111,"verifies":3112,"combinations":3113,"cached":3114,"being":3115,"test_phi3v":3116,"offers":3117,"tags":3118,"hugging_face_hub_token":3119,"hf_token":3120,"ipc":3121,"qwen3":3122,"6b":3123,"container":3124,"podman":3125,"args":3126,"shm":3127,"hood":3128,"particularly":3129,"included":3130,"8030":3131,"accepted":3132,"audio":3133,"optionally":3134,"docker_buildkit":3135,"widest":3136,"selinux":3137,"labeling":3138,"containers":3139,"buildah":3140,"discussions":3141,"4184":3142,"arm64":3143,"aarch64":3144,"hopper":3145,"writing":3146,"considered":3147,"linux":3148,"attempt":3149,"substantially":3150,"substantial":3151,"gh200":3152,"15gb":3153,"1475s":3154,"93gb":3155,"use_existing_torch":3156,"66":3157,"arm":3158,"cross":3159,"qemu":3160,"emulate":3161,"handlers":3162,"privileged":3163,"multiarch":3164,"reset":3165,"yes":3166,"secret":3167,"replaced":3168,"supposed":3169,"nccl":3170,"libnccl":3171,"permissions":3172,"parent":3173,"directories":3174,"vllm_nccl_so_path":3175,"scalable":3176,"learning":3177,"startup":3178,